src/DataProcessors/ВыгрузкаВБазуАршин/ВыгрузкаВБазуАршин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаВБазуАршин</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаХранения</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Перепрогон/Перепрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перепрогон</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписания</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ВыгрузкаВБазуАршин/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыгрузитьНаСервере()
ТабДок.Очистить();
БазаАршин = Справочники.ОбменДанными.НайтиПоНаименованию("База Аршин",Истина);
	Если Не БазаАршин.Пустая() Тогда
	ПутьКБазеАршин = СокрЛП(БазаАршин.ПутьКБазеДанных);
		Если СторонняяПоверка Тогда
		ИмяФайла = ПутьКБазеАршин+"Выгрузка СП от "+Формат(Период.ДатаОкончания,"ДФ=ddMMyyyy")+".xlsx";		
		Иначе	
		ИмяФайла = ПутьКБазеАршин+"Выгрузка от "+Формат(Период.ДатаОкончания,"ДФ=ddMMyyyy")+".xlsx";		
		КонецЕсли;
	Иначе	
	Сообщить("Не найдена База Аршин в справочнике обмена данными!");
	Возврат;	
	КонецЕсли;
БазаУК = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Справочники.ОбменДанными.НайтиПоНаименованию("База управления качеством",Истина));
	Если БазаУК = Неопределено Тогда
	Сообщить("Не установлена связь с базой УК");
	Возврат;
	КонецЕсли;
БазаУТ = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Справочники.ОбменДанными.НайтиПоНаименованию(Константы.БазаДанных1ССбыт.Получить(),Истина));
	Если БазаУТ = Неопределено Тогда
	Сообщить("Не установлена связь с базой УТ");
	Возврат;
	КонецЕсли;
Файл = Новый Файл(ПутьКБазеАршин);

	Если Не Файл.Существует() Тогда
	Сообщить("Каталог "+ПутьКБазеАршин+" - не доступен!");
	Возврат;
	КонецЕсли;
Макет = ПолучитьОбщийМакет("ВыгрузкаСИвБазуАршин");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");

ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.Регистратор.ДокументОснование КАК Документ,
	|	МестаХраненияОбороты.МПЗ КАК МПЗ,
	|	МестаХраненияОбороты.Регистратор.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, МестоХранения В ИЕРАРХИИ (&СписокМестХранения)) КАК МестаХраненияОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(МестаХраненияОбороты.Регистратор) = ТИП(Документ.ВыпускПродукции)
	|	И МестаХраненияОбороты.МПЗ.Товар.СИ = ИСТИНА
	|	И МестаХраненияОбороты.МПЗ.Товар.СторонняяПоверка = &СторонняяПоверка";
	Если СписокТоваров.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И МестаХраненияОбороты.МПЗ.Товар В ИЕРАРХИИ(&СписокТоваров)";
	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров);
	КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокМестХранения", СписокМестХранения);
Запрос.УстановитьПараметр("СторонняяПоверка", СторонняяПоверка);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	МестаХраненияОбороты.МПЗ.Товар.Наименование
								|ИТОГИ ПО
								|	МПЗ";
ОбщийМодульРегламентныеЗадания.ОбработкаЗапроса(БазаУТ,БазаУК,Запрос,ТабДок,ОблСтрока,Ложь);
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование КАК Документ,
	|	ДвижениеМПЗТабличнаяЧасть.МПЗ КАК МПЗ,
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ТИПЗНАЧЕНИЯ(ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование) = ТИП(Документ.Перепрогон)
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование.Статус = 1
	|	И ДвижениеМПЗТабличнаяЧасть.Ссылка.Проведен = ИСТИНА
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ.Товар.СИ = ИСТИНА
	|	И ДвижениеМПЗТабличнаяЧасть.МПЗ.Товар.СторонняяПоверка = &СторонняяПоверка";
	Если СписокТоваров.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ДвижениеМПЗТабличнаяЧасть.МПЗ.Товар В ИЕРАРХИИ(&СписокТоваров)";
	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО
								|	ДвижениеМПЗТабличнаяЧасть.МПЗ.Товар.Наименование
								|ИТОГИ ПО
								|	МПЗ КАК МПЗ";
ОбщийМодульРегламентныеЗадания.ОбработкаЗапроса(БазаУТ,БазаУК,Запрос,ТабДок,ОблСтрока,Истина);
ТабДок.ФиксацияСверху = 1;
ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Выгрузка в файл для базы Аршин...");
	ВыгрузитьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьБарКоды(СписокБарКодов)
ТабДок.Очистить();
БазаАршин = Справочники.ОбменДанными.НайтиПоНаименованию("База Аршин",Истина);
	Если Не БазаАршин.Пустая() Тогда
	ПутьКБазеАршин = СокрЛП(БазаАршин.ПутьКБазеДанных);
	ИмяФайла = ПутьКБазеАршин+"Выгрузка списка бар-кодов.xlsx";	
	Иначе	
	Сообщить("Не найдена База Аршин в справочнике обмена данными!");
	Возврат;	
	КонецЕсли;
БазаУК = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Справочники.ОбменДанными.НайтиПоНаименованию("База управления качеством",Истина));
	Если БазаУК = Неопределено Тогда
	Сообщить("Не установлена связь с базой УК");
	Возврат;
	КонецЕсли;
БазаУТ = ОбщийМодульСинхронизации.УстановитьCOMСоединение(Справочники.ОбменДанными.НайтиПоНаименованию(Константы.БазаДанных1ССбыт.Получить(),Истина));
	Если БазаУТ = Неопределено Тогда
	Сообщить("Не установлена связь с базой УТ");
	Возврат;
	КонецЕсли;
Файл = Новый Файл(ПутьКБазеАршин);

	Если Не Файл.Существует() Тогда
	Сообщить("Каталог "+ПутьКБазеАршин+" - не доступен!");
	Возврат;
	КонецЕсли;
Макет = ПолучитьОбщийМакет("ВыгрузкаСИвБазуАршин");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");

ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Ссылка.ДокументОснование.БарКод КАК БарКод,
	|	ВыпускПродукцииПоступление.Номенклатура.Товар КАК Товар,
	|	ВыпускПродукцииПоступление.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.БарКод В(&СписокБарКодов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар";
Запрос.УстановитьПараметр("СписокБарКодов", СписокБарКодов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Товар = ВыборкаДетальныеЗаписи.Товар;
	ДанныеИзУТ = ОбщийМодульРегламентныеЗадания.ПолучитьДанныеИзУТ(БазаУТ,Товар);
	МИ = ОбщийМодульРегламентныеЗадания.ПолучитьМИ(Товар,ДанныеИзУТ.МИ);
	МП = ОбщийМодульРегламентныеЗадания.ПолучитьМП(Товар);
	Наименование = СокрЛП(Товар.Наименование);
		Если Найти(Наименование,"[") > 0 Тогда                         
		Наименование = СокрП(Сред(Наименование,1,Найти(Наименование,"[")-1)); 
		КонецЕсли;
	БарКод = ВыборкаДетальныеЗаписи.БарКод;
	КодDanfoss = ОбщийМодульВызовСервера.ПолучитьКодDanfoss(БарКод);
	ДанныеИзУК = ОбщийМодульРегламентныеЗадания.ПолучитьДанныеИзУК(БазаУК,БарКод,КодDanfoss,Товар,ВыборкаДетальныеЗаписи.Дата); 
	ОблСтрока.Параметры.modification = Наименование;
	ОблСтрока.Параметры.signCipher = "ГМД";
	ОблСтрока.Параметры.miOwner = "ООО "+""""+"Завод № 423"+"""";
	ОблСтрока.Параметры.signMi = "false";
	ОблСтрока.Параметры.calibration = "false";
	ОблСтрока.Параметры.type = ?(ДанныеИзУК.ПервичнаяПоверка,"первичная","периодическая");
	ОблСтрока.Параметры.signPass = ?(ДанныеИзУК.ПервичнаяПоверка,"true","false");
	ОблСтрока.Параметры.manufactureNum = ?(ЗначениеЗаполнено(КодDanfoss),КодDanfoss,БарКод);
	ОблСтрока.Параметры.mitypeNumber = ?(ЗначениеЗаполнено(ДанныеИзУК.НомерВРеестре),ДанныеИзУК.НомерВРеестре,ДанныеИзУТ.НомерВРеестре);
	ОблСтрока.Параметры.vrfDate = Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=yyyy-MM-dd");
	ОблСтрока.Параметры.validDate = Формат(ДобавитьМесяц(ВыборкаДетальныеЗаписи.Дата,МИ*12)-86400,"ДФ=yyyy-MM-dd");
	ОблСтрока.Параметры.metrologist = ДанныеИзУК.Поверитель;
		Если ЗначениеЗаполнено(ДанныеИзУК.МП) Тогда
		ОблСтрока.Параметры.docTitle = ДанныеИзУК.МП;			
		ИначеЕсли ЗначениеЗаполнено(МП) Тогда	
		ОблСтрока.Параметры.docTitle = МП;
		Иначе
		ОблСтрока.Параметры.docTitle = ДанныеИзУТ.МП;
		КонецЕсли;
	ОблСтрока.Параметры.number = ДанныеИзУК.ПЭ;
	ОблСтрока.Параметры.typeNum = ДанныеИзУК.Вспомогательные;
	ОблСтрока.Параметры.temperature = ДанныеИзУК.Температура;
	ОблСтрока.Параметры.pressure = ДанныеИзУК.Давление;
	ОблСтрока.Параметры.hymidity = ДанныеИзУК.Влажность;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ТабДок.ФиксацияСверху = 1;
ТабДок.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c бар-кодами");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	СписокБарКодов = Новый СписокЗначений;
 
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка из файла...");
		СписокБарКодов.Добавить(СокрЛП(ExcelЛист.Cells(к,1).Value)); 
	    КонецЦикла;
	Результат.Excel.Quit();
	Состояние("Обработка...",,"Выгрузка в файл для базы Аршин...");
	ВыгрузитьБарКоды(СписокБарКодов);
	КонецЕсли;
КонецПроцедуры
